In [1]:
import numpy as np
import pandas as pd


#births CSV file
df = pd.read_csv(r'C:\Users\DELL\Desktop\data science DWIT\day10\births.csv')


Questions ::::
 1.) Extract the  data of only the Year == 1979 
 2.) Find maximum  birth of the Male in 1979 
 3.) Find maximum birth of the Female in 1979 
 4.) Find the maximum  number of birth  in 1979

In [2]:
df.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [3]:
df.tail()

       year  month  day gender  births
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15547 entries, 0 to 15546
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    15547 non-null  int64
 1   month   15547 non-null  int64
 2   day     15067 non-null  float64
 3   gender  15547 non-null  object
 4   births  15547 non-null  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 607.4+ KB

In [5]:
df.describe()

               year         month           day         births
count  15547.000000  15547.000000  15067.000000   15547.000000
mean    1979.037435      6.515919     17.769894    9762.293561
std        6.728340      3.449632     15.284034   28552.465810
min     1969.000000      1.000000      1.000000       1.000000
25%     1974.000000      4.000000      8.000000    4358.000000
50%     1979.000000      7.000000     16.000000    4814.000000
75%     1984.000000     10.000000     24.000000    5289.500000
max     2008.000000     12.000000     99.000000  199622.000000

In [6]:
df.shape

(15547, 5)

In [8]:
#getting data only of 1969 and storing in data frame 
df1979= df.loc[(df['year'] == 1979 )]
# the .loc is used to get the index value 

a1979 = np.array(df1979)
print( " the length of the year ",len(a1979))

 the length of the year  747

In [9]:
#getting only male births data of 1969 and storing in array
array1979BMale = np.array(df1979.loc[df['gender'] == 'M']['births'])
print(" The Male Birth", len(array1979BMale))

 The Male Birth 375

In [10]:

#getting only Female births data of 1969 and storing in array
array1979BFemale = np.array(df1979.loc[df['gender'] == 'F']['births'])
print("The Female Birth", len(array1979BFemale))

The Female Birth 372

In [11]:
#getting Total Birth of 1979

arraytotal = np.add(array1979BMale,array1979BFemale)
print("Total Birth",len(arraytotal))

ValueError: operands could not be broadcast together with shapes (375,) (372,)

In [ ]:
#getting maxBirthData
maxBirth = np.max(arraytotal)
print("max Birth",maxBirth)

In [ ]:
#Max Male and Female
maxMale = np.max(array1970BMale)
maxFeMale = np.max(array1970BFemale)
print("The Max Male Birth",maxMale )
print("The Max Female Birth", maxFeMale)

In [ ]:
# male bith ko index value nikaleko 
maxMaleBirthIndex = np.where(array1970BMale == maxMale)[0][0]
print("Max Male Birth Index",maxMaleBirthIndex)

In [ ]:
# Female bith ko index value nikaleko 
maxFeMaleBirthIndex = np.where(array1970BFemale == maxFeMale)[0][0]
print("Max Female Birth Index",maxFeMaleBirthIndex)

In [ ]:
# total birth in 1969 ko index nikaleko 
maxBirthIndex = np.where(arraytotal ==maxBirth)[0][0]
print("Max Birth Index Total",maxBirthIndex)

In [ ]:
#  Total male ko value kati xa , nikaleko 
valueofMale = array1970BMale[maxBirthIndex]
print("Value of Male ",valueofMale)

In [ ]:
# Total Female ko value kati xa , nikaleko 
valueofFeale = array1970BFemale[maxBirthIndex]
print("Value of Female",valueofFeale)

In [ ]:
mainarrayIndexMale = np.where(a1970 == valueofMale)[0][0]
print("Main Array Index Male :",mainarrayIndexMale)
maxBirthRowMale = df1970.loc[mainarrayIndexMale]
print("Max Birth Row Male :\n",maxBirthRowMale)